docs/diagrams/sequence/mermaid/structurizr-DeleteTask.mmd
graph LR
  linkStyle default fill:#ffffff

  subgraph diagram ["Dynamic View: Task Management"]
    style diagram fill:#ffffff,stroke:#ffffff

    subgraph 3 ["Task Management"]
      style 3 fill:#ffffff,stroke:#005696,color:#005696

      16("<div style='font-weight: bold'>Task Service</div><div style='font-size: 70%; margin-top: 0px'>[Container: Spring Boot]</div><div style='font-size: 80%; margin-top:10px'>Task Service</div>")
      style 16 fill:#ffffff,stroke:#005696,color:#005696
      4["<div style='font-weight: bold'>UI</div><div style='font-size: 70%; margin-top: 0px'>[Container: React]</div><div style='font-size: 80%; margin-top:10px'>Single Page Application</div>"]
      style 4 fill:#ffffff,stroke:#005696,color:#005696
      42("<div style='font-weight: bold'>Comment Service</div><div style='font-size: 70%; margin-top: 0px'>[Container: Spring Boot]</div><div style='font-size: 80%; margin-top:10px'>Comment Service</div>")
      style 42 fill:#ffffff,stroke:#005696,color:#005696
      5("<div style='font-weight: bold'>API Gateway</div><div style='font-size: 70%; margin-top: 0px'>[Container: Spring Cloud Gateway]</div><div style='font-size: 80%; margin-top:10px'>API Gateway</div>")
      style 5 fill:#ffffff,stroke:#005696,color:#005696
      58["<div style='font-weight: bold'>Message Broker</div><div style='font-size: 70%; margin-top: 0px'>[Container: RabbitMQ]</div><div style='font-size: 80%; margin-top:10px'>Message Broker</div>"]
      style 58 fill:#ffffff,stroke:#005696,color:#005696
      60[("<div style='font-weight: bold'>Task DB</div><div style='font-size: 70%; margin-top: 0px'>[Container: PostgreSQL]</div><div style='font-size: 80%; margin-top:10px'>RDBMS</div>")]
      style 60 fill:#ffffff,stroke:#005696,color:#005696
      62[("<div style='font-weight: bold'>Comment DB</div><div style='font-size: 70%; margin-top: 0px'>[Container: MongoDB]</div><div style='font-size: 80%; margin-top:10px'>Document Store</div>")]
      style 62 fill:#ffffff,stroke:#005696,color:#005696
    end

    1["<div style='font-weight: bold'>User</div><div style='font-size: 70%; margin-top: 0px'>[Person]</div><div style='font-size: 80%; margin-top:10px'>End User</div>"]
    style 1 fill:#ffffff,stroke:#4c8a1e,color:#4c8a1e

    1-. "<div>1. 1. Bấm xóa Task</div><div style='font-size: 70%'></div>" .->4
    4-. "<div>2. 2. DELETE /api/tasks/{id}</div><div style='font-size: 70%'>[JSON/HTTP]</div>" .->5
    5-. "<div>3. 3. Xóa Task trong DB</div><div style='font-size: 70%'></div>" .->16
    16-. "<div>4. 4. Xóa Task</div><div style='font-size: 70%'>[JDBC]</div>" .->60
    16-. "<div>5. 5. Publish 'task.deleted'<br />event</div><div style='font-size: 70%'></div>" .->58
    42-. "<div>6. 6. Subscribe event</div><div style='font-size: 70%'></div>" .->58
    42-. "<div>7. 7. Xóa toàn bộ Comment của<br />Task</div><div style='font-size: 70%'>[MongoDB Wire Protocol]</div>" .->62

  end
